## Loading Data

In [1]:
import pandas as pd

df=pd.read_csv("C:\\Users\\Mohamed\\Downloads\\autovison.csv")

## Data Exploration

In [2]:
df.head()

,Brand,Price,Body,Mileage,EngineV,Engine Type,Registration,Year,Model
0,BMW,4200.0,sedan,277,2.0,Petrol,yes,1991,320
1,Mercedes-Benz,7900.0,van,427,2.9,Diesel,yes,1999,Sprinter 212
2,Mercedes-Benz,13300.0,sedan,358,5.0,Gas,yes,2003,S 500
3,Audi,23000.0,crossover,240,4.2,Petrol,yes,2007,Q7
4,Toyota,18300.0,crossover,120,2.0,Petrol,yes,2011,Rav 4

In [3]:
df.shape

(4345, 9)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4345 entries, 0 to 4344
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         4345 non-null   object
 1   Price         4173 non-null   float64
 2   Body          4345 non-null   object
 3   Mileage       4345 non-null   int64
 4   EngineV       4195 non-null   float64
 5   Engine Type   4345 non-null   object
 6   Registration  4345 non-null   object
 7   Year          4345 non-null   int64
 8   Model         4345 non-null   object
dtypes: float64(2), int64(2), object(5)
memory usage: 305.6+ KB

In [5]:
df.describe()

               Price      Mileage      EngineV         Year
count    4173.000000  4345.000000  4195.000000  4345.000000
mean    19418.746935   161.237284     2.790734  2006.550058
std     25584.242620   105.705797     5.066437     6.719097
min       600.000000     0.000000     0.600000  1969.000000
25%      6999.000000    86.000000     1.800000  2003.000000
50%     11500.000000   155.000000     2.200000  2008.000000
75%     21700.000000   230.000000     3.000000  2012.000000
max    300000.000000   980.000000    99.990000  2016.000000

In [6]:
df.isnull().sum()

Brand             0
Price           172
Body              0
Mileage           0
EngineV         150
Engine Type       0
Registration      0
Year              0
Model             0
dtype: int64

In [7]:
df.duplicated().sum()

np.int64(73)

In [ ]:

df = df.drop_duplicates()
df['Price'].fillna(df['Price'].mean(), inplace=True)
df['EngineV'].fillna(df['EngineV'].mean(), inplace=True)

C:\Users\Mohamed\AppData\Local\Temp\ipykernel_8944\1313312609.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Price'].fillna(df['Price'].mean(), inplace=True)
C:\Users\Mohamed\AppData\Local\Temp\ipykernel_8944\1313312609.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['EngineV'].fillna(df['EngineV'].mean(), inplace=True)

In [9]:
df.shape

(4272, 9)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4272 entries, 0 to 4344
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         4272 non-null   object
 1   Price         4272 non-null   float64
 2   Body          4272 non-null   object
 3   Mileage       4272 non-null   int64
 4   EngineV       4272 non-null   float64
 5   Engine Type   4272 non-null   object
 6   Registration  4272 non-null   object
 7   Year          4272 non-null   int64
 8   Model         4272 non-null   object
dtypes: float64(2), int64(2), object(5)
memory usage: 333.8+ KB

In [12]:
df.to_csv("C:\\Users\\Mohamed\\Desktop\\Discrete\\autovision.csv")